#ifndef _APPCONFIG_H_
#define _APPCONFIG_H_

/**************************************************************************************************
|-------------------------------------------------------------------------------------------------|
|版本信息： 
|		  	| 2021/06/03 |
|         	| FN1110-L-1.0.0.210603|
|功能信息：
|		  	|看门狗|ON|
|			|总电流保护|OFF|
|			|适配器保护|OFF|
|更新记录：
|		  	| 尝试修复正常上报QN会使用上一次查询的QN的情况	固定QN上传长度8+9|
|更新效果：
|		 	| 未成功
|-------------------------------------------------------------------------------------------------|
***************************************************************************************************/
/**************************************************************************************************
|-------------------------------------------------------------------------------------------------|
|版本信息： 
|		  	| 2021/06/07 |
|         	| FN1110-L-1.0.0.210607|
|功能信息：
|		  	|看门狗|ON|
|			|总电流保护|OFF|
|			|适配器保护|OFF|
|更新记录：
|		  	| 尝试修复正常上报QN会使用上一次查询的QN的情况	固定QN上传长度8+9|
|更新效果：
|		 	|
|-------------------------------------------------------------------------------------------------|
***************************************************************************************************/
/**************************************************************************************************
|-------------------------------------------------------------------------------------------------|
|版本信息： 
|		  	| 2021/12/16 |
|         	| FN1110-L-1.0.0.211216|
|功能信息：
|		  	|看门狗|ON|
|			|总电流保护|OFF|
|			|适配器保护|OFF|
|更新记录：
|		  	| 添加MAC地址配置功能，解决时间配置有时无法生效问题 |
|更新效果：
|		 	|
|-------------------------------------------------------------------------------------------------|
***************************************************************************************************/
/**************************************************************************************************
|-------------------------------------------------------------------------------------------------|
|版本信息： 
|		  	| 2022/05/23 |
|         	| FN1110-L-1.0.1.220523|
|功能信息：
|		  	|看门狗|ON|
|			|总电流保护|OFF|
|			|适配器保护|OFF|
|更新记录：
|		  	| 添加掉电、欠压检测，防止电量不足时程序反复重启，读取W25Q128，出现恢复出厂设置的现象 |
|更新效果：
|		 	|
|-------------------------------------------------------------------------------------------------|
***************************************************************************************************/
/* 代码版本 */
#define SOFT_NO_STR ("FN-ZTGD-QG-1.0.0") // 软件版本号
#define SOFT_NO_DAT ("20240204") 				 // 日期
#define HARD_NO_STR	("FN-ZTGD-QG")			 // 硬件版本号


#define COM_DATA_VERSION  0x12  

/* 代码开关位 */
#define DET_TOTALVAL_STATUS  	1   // 总电压安全检查功能
#define DET_TOTALVIN_STATUS  	1	 	// 总电流安全检查功能

/* 标志 - 屏蔽功能宏定义后，不启用功能 */
//#define COM_GPS_ENABLE   // GPS功能
//#define SPD_ENABLE 		     // 防雷器
//#define BAT_ENABLE 		     // 电池检测
//#define SIM_ENABLE 		     // SIM卡检测
#define WATER_ENABLE 		   // 水浸检测
#define ANGLE_ENABLE 		   // 水浸检测

#define ERR_ENABLE 		     // 故障码使能


#define PING_DEBUG   				0
#define COM_DEBUG    				0  
#define SAVE_DEBUG   				0   // 保存
#define ONVIF_DEBUG 				0
#define ERROR_DEBUG  				0
#define DIRECT_REP_DEBUG  	0   // 立刻上报
#define PRINT_DEBUG  				0  // 打印调试
#define UPDATE_DEBUG  			0  // 打印调试
#define GPRS_DEBUG  				0  // 打印调试
#define ONVIF_SEARCH_DEBUG  0
#define TCP_SERVER_DEBUG  	0
#define TCP_CLIENT_DEBUG  	0
#define ENCRYPT_DEBUG     	0
#define HTTP_COM_DEBUG    	0


#define THE_FIRST_TERM  		1
#define THE_SECOND_TERM 		2

#define VERSION_INFOR_FLAG THE_SECOND_TERM

/* 参数 */
#define MAINS_220V_ACCESS_VOLTAGE    (100) 
#define MAINS_220V_MAX_CURRENT_VALUE (1500) 		// 1500ma
#define CABINET_POSTRUE 			 			 (40)



#endif
